/* CUSMENU.rexx - Customer Management submenu */
EXEC CICS ASSIGN USERID(UID) END-EXEC
EXEC CICS ASSIGN DATE(TODAY) TIME(NOWTIME) END-EXEC
DISPDATE = SUBSTR(TODAY,5,2)'/'SUBSTR(TODAY,7,2)'/'SUBSTR(TODAY,1,4)
DISPTIME = SUBSTR(NOWTIME,1,2)':'SUBSTR(NOWTIME,3,2)':'SUBSTR(NOWTIME,5,2)
USERGROUPS='PUBLIC'
USERSCONF='users.conf'
DO WHILE LINES(USERSCONF)>0
  RL=LINEIN(USERSCONF)
  IF LEFT(RL,1)='#'|RL='' THEN ITERATE
  PARSE VAR RL CU ':' CH ':' CG
  IF TRANSLATE(STRIP(CU))=TRANSLATE(STRIP(UID)) THEN DO
    USERGROUPS=TRANSLATE(STRIP(CG)); LEAVE
  END
END
CALL LINEOUT USERSCONF
ISADMIN=(POS('ADMIN',USERGROUPS)>0)
ISUSERS=(POS('USERS',USERGROUPS)>0)|ISADMIN
IF ISADMIN THEN ROLESTR='ACCESS: ADMIN'
ELSE IF ISUSERS THEN ROLESTR='ACCESS: USERS'
ELSE ROLESTR='ACCESS: PUBLIC'
OUT.DATFLD=DISPDATE; OUT.TIMFLD=DISPTIME
OUT.USRFLD=STRIP(UID); OUT.ROLEFLD=ROLESTR

N=0
N=N+1; TXID.N='CUST'; TXDESC.N='CUSTOMER INQUIRY (REXX)';  TXGRP.N='users'
N=N+1; TXID.N='CUSV'; TXDESC.N='CUSTOMER SAVE (REXX)';     TXGRP.N='users'
N=N+1; TXID.N='CUSL'; TXDESC.N='CUSTOMER LIST (REXX)';     TXGRP.N='users'
N=N+1; TXID.N='GUST'; TXDESC.N='CUSTOMER (COBOL)';         TXGRP.N='users'
N=N+1; TXID.N='GUSV'; TXDESC.N='CUSTOMER SAVE (COBOL)';    TXGRP.N='users'
N=N+1; TXID.N='GUSL'; TXDESC.N='CUSTOMER LIST (COBOL)';    TXGRP.N='users'
TOTALMASTER=N

VISCOUNT=0
DO I=1 TO TOTALMASTER
  ALLOWED=0
  IF TXGRP.I='public' THEN ALLOWED=1
  IF TXGRP.I='users'&ISUSERS THEN ALLOWED=1
  IF TXGRP.I='admin'&ISADMIN THEN ALLOWED=1
  IF ALLOWED THEN DO
    VISCOUNT=VISCOUNT+1
    VISID.VISCOUNT=TXID.I; VISDESC.VISCOUNT=TXDESC.I
  END
END

DO V=1 TO VISCOUNT
  NUM=RIGHT(V,2,'0')
  INTERPRET "OUT.L"||NUM" = LEFT(NUM'.  'VISID.V'  'VISDESC.V, 38)"
END

EXEC CICS SEND MAP('CUSMENU') MAPSET('CUSMENU') FROM(OUT.) ERASE END-EXEC
EXEC CICS RECEIVE MAP('CUSMENU') MAPSET('CUSMENU') INTO(IN.) END-EXEC

IF C2X(EIBAID)='F1' THEN EXEC CICS RETURN TRANSID('MYMU') END-EXEC
IF C2X(EIBAID)='F3' THEN EXEC CICS RETURN TRANSID('MYMU') END-EXEC

SEL=STRIP(IN.SELFLD)
IF DATATYPE(SEL,'N') THEN DO
  SELNUM=SEL+0
  IF SELNUM>=1 & SELNUM<=VISCOUNT THEN DO
    DEST = VISID.SELNUM
    EXEC CICS XCTL PROGRAM(DEST) END-EXEC
  END
END

SEL=STRIP(IN.SELFLD)
IF DATATYPE(SEL,'N') THEN DO
  SELNUM=SEL+0
  IF SELNUM>=1 & SELNUM<=VISCOUNT THEN DO
    DEST = VISID.SELNUM
    EXEC CICS XCTL PROGRAM(DEST) END-EXEC
  END
END
EXEC CICS RETURN TRANSID('CUSM') END-EXEC
