/* MYHELP.rexx - Help screen, returns to caller via COMMAREA */
EXEC CICS ASSIGN EIBCALEN(CALEN) END-EXEC

IF CALEN > 0 THEN DO
  CALLER = STRIP(SUBSTR(DFHCOMMAREA,1,4))
  EXEC CICS RETURN TRANSID(CALLER) END-EXEC
END

CALLER = 'MYMU'
OUT.CALLFLD = CALLER
EXEC CICS SEND MAP('MYHELP') MAPSET('MYHELP') FROM(OUT.) ERASE END-EXEC
EXEC CICS RETURN TRANSID('MHLP') COMMAREA(CALLER) LENGTH(4) END-EXEC