/* REXMENU.rexx - REXX Programs submenu */
EXEC CICS ASSIGN USERID(UID) END-EXEC
EXEC CICS ASSIGN DATE(TODAY) TIME(NOWTIME) END-EXEC
DISPDATE = SUBSTR(TODAY,5,2)'/'SUBSTR(TODAY,7,2)'/'SUBSTR(TODAY,1,4)
DISPTIME = SUBSTR(NOWTIME,1,2)':'SUBSTR(NOWTIME,3,2)':'SUBSTR(NOWTIME,5,2)
USERGROUPS='PUBLIC'
USERSCONF='runtime/users.conf'
DO WHILE LINES(USERSCONF)>0
  RL=LINEIN(USERSCONF)
  IF LEFT(RL,1)='#'|RL='' THEN ITERATE
  PARSE VAR RL CU ':' CH ':' CG
  IF TRANSLATE(STRIP(CU))=TRANSLATE(STRIP(UID)) THEN DO
    USERGROUPS=TRANSLATE(STRIP(CG)); LEAVE
  END
END
CALL LINEOUT USERSCONF
ISADMIN=(POS('ADMIN',USERGROUPS)>0)
ISUSERS=(POS('USERS',USERGROUPS)>0)|ISADMIN
IF ISADMIN THEN ROLESTR='ACCESS: ADMIN'
ELSE IF ISUSERS THEN ROLESTR='ACCESS: USERS'
ELSE ROLESTR='ACCESS: PUBLIC'
OUT.DATFLD=DISPDATE; OUT.TIMFLD=DISPTIME
OUT.USRFLD=STRIP(UID); OUT.ROLEFLD=ROLESTR

N=0
N=N+1; TXID.N='hello'; TXDESC.N='HELLO (REXX)';        TXGRP.N='public'
N=N+1; TXID.N='exam';  TXDESC.N='EXAM REXX';            TXGRP.N='users'
N=N+1; TXID.N='qage';  TXDESC.N='QUEUE AGE (REXX)';     TXGRP.N='users'
N=N+1; TXID.N='qagr';  TXDESC.N='QUEUE AGR (REXX)';     TXGRP.N='users'
N=N+1; TXID.N='timr';  TXDESC.N='TIMER REXX';           TXGRP.N='users'
N=N+1; TXID.N='sqlr';  TXDESC.N='SQL DEMO REXX';        TXGRP.N='admin'
N=N+1; TXID.N='dodfr'; TXDESC.N='DOD FRAME REXX';       TXGRP.N='admin'
TOTALMASTER=N

VISCOUNT=0
DO I=1 TO TOTALMASTER
  ALLOWED=0
  IF TXGRP.I='public' THEN ALLOWED=1
  IF TXGRP.I='users'&ISUSERS THEN ALLOWED=1
  IF TXGRP.I='admin'&ISADMIN THEN ALLOWED=1
  IF ALLOWED THEN DO
    VISCOUNT=VISCOUNT+1
    VISID.VISCOUNT=TXID.I; VISDESC.VISCOUNT=TXDESC.I
  END
END

DO V=1 TO VISCOUNT
  NUM=RIGHT(V,2,'0')
  INTERPRET "OUT.L"||NUM" = LEFT(NUM'.  'VISID.V'  'VISDESC.V, 38)"
END

EXEC CICS SEND MAP('REXMENU') MAPSET('REXMENU') FROM(OUT.) ERASE END-EXEC
EXEC CICS RECEIVE MAP('REXMENU') MAPSET('REXMENU') INTO(IN.) END-EXEC

IF EIBAID=DFHPF1 THEN EXEC CICS XCTL PROGRAM('CSSF') END-EXEC
IF EIBAID=DFHPF3 THEN EXEC CICS RETURN TRANSID('MYMU') END-EXEC
IF EIBAID=DFHPF9 THEN EXEC CICS XCTL PROGRAM('MYHELP') COMMAREA('REXM') END-EXEC

SEL=STRIP(IN.SELFLD)
IF DATATYPE(SEL,'N') THEN DO
  SELNUM=SEL+0
  IF SELNUM>=1&SELNUM<=VISCOUNT THEN
    EXEC CICS XCTL PROGRAM(VISID.SELNUM) END-EXEC
END
EXEC CICS RETURN TRANSID('REXM') END-EXEC
