/* MYHELP.rexx - Help screen. COMMAREA is the 4-char caller TRANSID. */
EXEC CICS ASSIGN EIBCALEN(CALEN) END-EXEC
CALLER = 'MYMU'
IF CALEN >= 4 THEN CALLER = STRIP(SUBSTR(DFHCOMMAREA,1,4))
IF CALLER = '' THEN CALLER = 'MYMU'

OUT.CALLFLD = CALLER
EXEC CICS SEND MAP('MYHELP') MAPSET('MYHELP') FROM(OUT.) ERASE END-EXEC
EXEC CICS RECEIVE MAP('MYHELP') MAPSET('MYHELP') INTO(IN.) END-EXEC
EXEC CICS RETURN TRANSID(CALLER) END-EXEC
