/* REXMENU.rexx - REXX Programs submenu */
EXEC CICS ASSIGN USERID(UID) END-EXEC
EXEC CICS ASSIGN DATE(TODAY) TIME(NOWTIME) END-EXEC
DISPDATE = SUBSTR(TODAY,5,2)'/'SUBSTR(TODAY,7,2)'/'SUBSTR(TODAY,1,4)
DISPTIME = SUBSTR(NOWTIME,1,2)':'SUBSTR(NOWTIME,3,2)':'SUBSTR(NOWTIME,5,2)
USERGROUPS='PUBLIC'
USERSCONF='users.conf'
DO WHILE LINES(USERSCONF)>0
  RL=LINEIN(USERSCONF)
  IF LEFT(RL,1)='#'|RL='' THEN ITERATE
  PARSE VAR RL CU ':' CH ':' CG
  IF TRANSLATE(STRIP(CU))=TRANSLATE(STRIP(UID)) THEN DO
    USERGROUPS=TRANSLATE(STRIP(CG)); LEAVE
  END
END
CALL LINEOUT USERSCONF
ISADMIN=(POS('ADMIN',USERGROUPS)>0)
ISUSERS=(POS('USERS',USERGROUPS)>0)|ISADMIN
IF ISADMIN THEN ROLESTR='ACCESS: ADMIN'
ELSE IF ISUSERS THEN ROLESTR='ACCESS: USERS'
ELSE ROLESTR='ACCESS: PUBLIC'
OUT.DATFLD=DISPDATE; OUT.TIMFLD=DISPTIME
OUT.USRFLD=STRIP(UID); OUT.ROLEFLD=ROLESTR

N=0
N=N+1; TXID.N='HELO'; TXDESC.N='HELLO (REXX)';        TXGRP.N='public'
N=N+1; TXID.N='EXAR';  TXDESC.N='EXAM REXX';            TXGRP.N='users'
N=N+1; TXID.N='QAGE';  TXDESC.N='QUEUE AGE (REXX)';     TXGRP.N='users'
N=N+1; TXID.N='QAGR';  TXDESC.N='QUEUE AGR (REXX)';     TXGRP.N='users'
N=N+1; TXID.N='TIMR';  TXDESC.N='TIMER REXX';           TXGRP.N='users'
N=N+1; TXID.N='SQLR';  TXDESC.N='SQL DEMO REXX';        TXGRP.N='admin'
N=N+1; TXID.N='DODF';  TXDESC.N='DOD FRAME REXX';       TXGRP.N='admin'
N=N+1; TXID.N='BRDS'; TXDESC.N='BRDS (REXX)';             TXGRP.N='users'
N=N+1; TXID.N='CHAT'; TXDESC.N='CHAT DEMO (REXX)';         TXGRP.N='users'
N=N+1; TXID.N='CSGM'; TXDESC.N='CSGM GMTEXT (REXX)';       TXGRP.N='public'
N=N+1; TXID.N='MNDL'; TXDESC.N='MANDELBROT (REXX)';        TXGRP.N='users'
N=N+1; TXID.N='MNDU'; TXDESC.N='JULIA SET (REXX)';         TXGRP.N='users'
N=N+1; TXID.N='TIME'; TXDESC.N='TIME (REXX)';              TXGRP.N='public'
N=N+1; TXID.N='WAPI'; TXDESC.N='WAPI DEMO (REXX)';         TXGRP.N='users'
TOTALMASTER=N

VISCOUNT=0
DO I=1 TO TOTALMASTER
  ALLOWED=0
  IF TXGRP.I='public' THEN ALLOWED=1
  IF TXGRP.I='users'&ISUSERS THEN ALLOWED=1
  IF TXGRP.I='admin'&ISADMIN THEN ALLOWED=1
  IF ALLOWED THEN DO
    VISCOUNT=VISCOUNT+1
    VISID.VISCOUNT=TXID.I; VISDESC.VISCOUNT=TXDESC.I
  END
END

DO V=1 TO VISCOUNT
  NUM=RIGHT(V,2,'0')
  INTERPRET "OUT.L"||NUM" = LEFT(NUM'.  'VISID.V'  'VISDESC.V, 38)"
END

EXEC CICS SEND MAP('REXMENU') MAPSET('REXMENU') FROM(OUT.) ERASE END-EXEC
EXEC CICS RECEIVE MAP('REXMENU') MAPSET('REXMENU') INTO(IN.) END-EXEC

IF C2X(EIBAID)='F1' THEN EXEC CICS RETURN TRANSID('MYMU') END-EXEC
IF C2X(EIBAID)='F3' THEN EXEC CICS RETURN TRANSID('MYMU') END-EXEC

SEL=STRIP(IN.SELFLD)
IF DATATYPE(SEL,'N') THEN DO
  SELNUM=SEL+0
  IF SELNUM>=1 & SELNUM<=VISCOUNT THEN DO
    DEST = VISID.SELNUM
    EXEC CICS XCTL PROGRAM(DEST) END-EXEC
  END
END
EXEC CICS RETURN TRANSID('REXM') END-EXEC
