       IDENTIFICATION DIVISION.
       PROGRAM-ID. DODF.
       ENVIRONMENT DIVISION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       01 SCR.
          05 SCR-TERMID     PIC X(8).
          05 FILLER         PIC X(72).

       PROCEDURE DIVISION.
           EXEC CICS ASSIGN TERMID(SCR-TERMID) END-EXEC
           MOVE SPACES TO SCR
           MOVE SCR-TERMID TO SCR-TERMID

           EXEC CICS SEND MAP('DODF1') FROM(SCR) ERASE END-EXEC

           IF EIBAID = DFHENTER
               EXEC CICS RETURN TRANSID('DODC') END-EXEC
           ELSE IF EIBAID = DFHPF3
               EXEC CICS RETURN END-EXEC
           ELSE
               EXEC CICS RETURN TRANSID('DODF') END-EXEC
           END-IF.
       END PROGRAM DODF.
